DataProcessors/ЛБ_РабочееМестоТовароведа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_РабочееМестоТовароведа</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДоговоровЗаймаХранения</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ЛБ_РабочееМестоТовароведа/Forms/ФормаНастройки/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ
#Область ОписаниеПеременных

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИменаНастроек.Добавить("Организация");
	ИменаНастроек.Добавить("Подразделение");
	ИменаНастроек.Добавить("Склад");
	
	СтруктураИсходныхНастроек = Новый Структура;
	
	Для Каждого ЭлементНастройки Из ИменаНастроек Цикл
		
		ИмяНастройки = ЭлементНастройки.Значение;
		
		// начальное заполнение реквизитов формы
		Параметры.Свойство(ИмяНастройки, ЭтотОбъект[ИмяНастройки]);
		
		// сохраняем исходные настройки
		СтруктураИсходныхНастроек.Вставить(ИмяНастройки, ЭтотОбъект[ИмяНастройки]);
		
	КонецЦикла;
	
	АдресВременногоХранилищаЗначенийИсходныхНастроек = ПоместитьВоВременноеХранилище(СтруктураИсходныхНастроек, УникальныйИдентификатор);
	
	УправлениеФормой();
	
КонецПроцедуры	

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ
#Область ОбработчикиСобытийЭлементовШапкиФормы

	

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЦЫ ФОРМЫ <ИМЯТАБЛИЦЫФОРМЫ>
#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы

	

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураИсходныхНастроек = ЗаписатьНастройкиНаСервере();
	
	Закрыть(СтруктураИсходныхНастроек);
	
КонецПроцедуры	

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.Подразделение.Видимость = БухгалтерскийУчетПереопределяемый.ВестиУчетПоПодразделениям();
	
КонецПроцедуры


&НаСервере
Функция ЗаписатьНастройкиНаСервере()
	
	СтруктураИзмененныхНастроек = Новый Структура;
	
	СтруктураИсходныхНастроек = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаЗначенийИсходныхНастроек);
	
	Для Каждого ЭлементНастройки Из ИменаНастроек Цикл
		
		ИмяНастройки = ЭлементНастройки.Значение;
		
		Если ЭтотОбъект[ИмяНастройки] <> СтруктураИсходныхНастроек[ИмяНастройки] Тогда
			ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
				"ЛБ_РабочееМестоТовароведа",
				ИмяНастройки,
				ЭтотОбъект[ИмяНастройки]
			);
			СтруктураИзмененныхНастроек.Вставить(ИмяНастройки, ЭтотОбъект[ИмяНастройки]);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураИзмененныхНастроек;
	
КонецФункции	

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
// ИНИЦИАЛИЗАЦИЯ
#Область Инициализация

	

#КонецОбласти
